# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],     # 0-P1/2    0
   [-1, 1, Conv, [128, 3, 1]],  # 1         1
   [-1,1,space_to_depth,[1]],   # 2 -P2/4   3/4
   [-1, 3, C3, [128]],          # 3         5 
   [-1, 1, Conv, [256, 3, 1]],  # 4         6
   [-1,1,space_to_depth,[1]],   # 5 -P3/8   7/8
   [-1, 6, C3, [256]],          # 6!!!!!!!  9
   [-1, 1, Conv, [512, 3, 1]],  # 7-P4/16   10
   [-1,1,space_to_depth,[1]],   # 8 -P4/16  11 12
   [-1, 9, C3, [512]],          # 9#######  13
   [-1, 1, Conv, [1024, 3, 1]], # 10-P5/32  14 
   [-1,1,space_to_depth,[1]],   # 11 -P5/32 15 16
   [-1, 3, C3, [1024]],         # 12        17  
   [-1, 1, SPPCSPC, [1024, 5]],    # 13     18 
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 14                  19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 15                  20
   [[-1, 9], 1, Concat, [1]],                     # 16 cat backbone P4  21
   [-1, 3, C3, [512, False]],                     # 17###########       22

   [-1, 1, Conv, [256, 1, 1]],                    # 18                  23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 19                  24
   [[-1, 6], 1, Concat, [1]],                     # 20 cat backbone P3  25
   [-1, 3, C3, [256, False]],                     # 21 (P3/8-small)!!!  26

   [-1, 1, Conv, [256, 3, 1]],                    # 22                  27
   [-1,1,space_to_depth,[1]],                     # 23 -P2/4            28/30
   [[-1, 18], 1, Concat, [1]],                    # 24 cat head P4      29
   [-1, 3, C3, [512, False]],                     # 25 (P4/16-medium)   31

   [-1, 1, Conv, [512, 3, 1]],                    # 26                  32 
   [-1,1,space_to_depth,[1]],                     # 27 -P2/4            33/35
   [[-1, 14], 1, Concat, [1]],                    # 28 cat head P5      34
   [-1, 3, C3, [1024, False]],                    # 29 (P5/32-large)    36

   [[21, 25, 29], 1, ASFF_Detect, [nc, anchors]],  # Detect(P3, P4, P5)      
  ]
